# this is purely to test stripping on a to be deteled brach

In [1]:
import os
import sys

import pandas as pd
import numpy as np

In [2]:

# initialize list of lists
data1 = [['frank', 11], ['sushi', 15], ['julie', 14]]
 
# Create the pandas DataFrame
df1 = pd.DataFrame(data1, columns=['Name', 'Age'])
df1

    Name  Age
0  frank   11
1  sushi   15
2  julie   14

In [3]:
data2 = [['frank', 'Zaandam'], ['julie', 'Rotterdam'], ['sushi', 'Amstersdam']]
 
# Create the pandas DataFrame
df2 = pd.DataFrame(data2, columns=['Name', 'City'])
df2

    Name        City
0  frank     Zaandam
1  julie   Rotterdam
2  sushi  Amstersdam

In [7]:
 #= data1.merge([data2], on='Name')
merged = df1.merge(df2, left_on='Name', right_on='Name')

In [8]:
merged

    Name  Age        City
0  frank   11     Zaandam
1  sushi   15  Amstersdam
2  julie   14   Rotterdam